In [60]:
import pandas as pd
import numpy as np
df = pd.DataFrame(np.arange(0,12).reshape(4,3),index = ['Row1','Row2','Row3','Row4'],columns = ['col1','col2','col3'])
type(df.head())
df.head()

      col1  col2  col3
Row1     0     1     2
Row2     3     4     5
Row3     6     7     8
Row4     9    10    11

In [62]:
df.to_csv('Test.csv')

In [34]:
df.loc['Row2']

col1    3
col2    4
col3    5
Name: Row2, dtype: int32

In [38]:
df.iloc[1:3,0:2].values.shape

(2, 2)

In [42]:
df['col3'].value_counts()

5     1
11    1
2     1
8     1
Name: col3, dtype: int64

In [45]:
df['col3'].unique()

array([ 2,  5,  8, 11])

In [58]:
test_df=pd.read_csv('Test1.csv',sep= ';')
test_df.head()

  Unnamed: 0  col1  col2  col3  col4  col5
0       Row1     0   1.0   2.0     3     5
1       Row2     3   NaN   NaN     7     9
2       Row3     6   7.0   8.0     0     4
3       Row4     9   8.0   8.0     4     5
4       Row5     0   7.0   8.0     0     0

In [59]:
test_df.isnull().sum()

Unnamed: 0    0
col1          0
col2          1
col3          1
col4          0
col5          0
dtype: int64

In [65]:
df1 = pd.read_csv('Test.csv')
df1.head()

  Unnamed: 0  col1  col2  col3
0       Row1     0     1     2
1       Row2     3     4     5
2       Row3     6     7     8
3       Row4     9    10    11

In [66]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  4 non-null      object
 1   col1        4 non-null      int64
 2   col2        4 non-null      int64
 3   col3        4 non-null      int64
dtypes: int64(3), object(1)
memory usage: 256.0+ bytes

In [67]:
df.describe()

           col1       col2       col3
count  4.000000   4.000000   4.000000
mean   4.500000   5.500000   6.500000
std    3.872983   3.872983   3.872983
min    0.000000   1.000000   2.000000
25%    2.250000   3.250000   4.250000
50%    4.500000   5.500000   6.500000
75%    6.750000   7.750000   8.750000
max    9.000000  10.000000  11.000000

In [68]:
df

      col1  col2  col3
Row1     0     1     2
Row2     3     4     5
Row3     6     7     8
Row4     9    10    11